{
  "job_title": "Golang Engineer",
  "company": "Canonical",
  "posted_date": "2025-04-25",
  "requirements": "Canonical is a leading provider of open-source software and operating systems for global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in more than 80 countries and very few office-based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.\nThe company is founder led, profitable and growing.\nWe are hiring Golang engineers of all levels of seniority, for all relevant teams at Canonical. Apply here if you are an exceptional software engineer who prefers to work in Go. After the first round of interviews we’ll find the best fit product team at Canonical for you to progress your application based on your personal interests.\nCanonical prefers Golang for software where performance and security are primary considerations. We also have substantial projects in Python, C, C++ and are starting to invest in Rust. For front-end development we prefer React and Flutter.\nGolang is an essential language for our engineering teams, who build the systems that deliver Ubuntu to the world. From our software distribution systems, to those which build and test every possible kind of open source on every architecture, from our systems management tools to our distributed systems operations R&D, we count on Golang for its tasteful concurrency and developer ecosystem. Juju, Livepatch, LXD, MAAS, Microk8s, Snapd, Ubuntu Core, Ubuntu Pro, and many more Canonical offerings include Golang components.\nWe also want to ensure that Ubuntu is the very best platform for Golang development, offering easy access to the widest range of tooling and capabilities that support cutting edge open source and enterprise development.\nJoin us in our mission to deliver innovative open-source solutions to individuals and enterprises around the world. We expect the highest engineering standards and strong motivation to get things done well in a fully remote and distributed environment. These roles require extensive personal experience with Linux - the more different versions of Linux the better!\nLocation: we have open roles for Golang engineers in every time zone\nThe role entails\n    Design and implement well-tested and documented software in Go\n    Debug and fix issues encountered by your users\n    Participate in our engineering process through code and architectural reviews\n    Collaborate with community and colleagues on technical specifications\n    Seek improvements to engineering and operations practices\n    In some cases, deploy and operate services developed by the team\n    Contribute to the success of your product through technical advocacy\nWhat we are looking for in you\n    An exceptional academic track record from both high school and university\n    Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path\n    Drive and a track record of going above-and-beyond expectations\n    Well-organized, self-starting and able to deliver to schedule\n    Professional manner interacting with colleagues, partners, and community\n    Experience designing and writing high-quality Golang software on Linux\n    Experience with and passion for Linux at the system level\n    For more senior roles, experience building, deploying, and operating distributed systems and APIs\n    Professional written and spoken English \n    Experience with Linux (Debian or Ubuntu preferred) \n    Excellent interpersonal skills, curiosity, flexibility, and accountability \n    Passion, thoughtfulness, and self-motivation \n    Excellent communication and presentation skills \n    Result-oriented, with a personal drive to meet commitments \n    Ability to travel twice a year, for company events up to two weeks each\nNice-to-have skills\n    Experience developing for Ubuntu Linux\n    Experience with Juju, LXD, Microk8s, Snapd, Ubuntu Core, Ubuntu Pro\n    Performance engineering and security experience\nWhat we offer colleagues\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognize outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\n    Distributed work environment with twice-yearly team sprints in person\n    Personal learning and development budget of USD 2,000 per year\n    Annual compensation review\n    Recognition rewards\n    Annual holiday leave\n    Maternity and paternity leave\n    Employee Assistance Program\n    Opportunity to travel to new locations to meet colleagues\n    Priority Pass, and travel upgrades for long haul company events\nAbout Canonical\nCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.\nCanonical is an equal opportunity employer\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\n",
  "salary_annual": null,
  "company_country": "GB",
  "company_address": "London",
  "classification": "remote_worldwide",
  "source_url": "https://www.golangprojects.com/golang-go-job-gor-Remote-Golang-Engineer-Canonical-remotework.html",
  "scraped_at": "2025-05-04T12:26:59.762759+00:00"
}