{
  "job_title": "Software Engineer III",
  "company": "Jack Henry",
  "posted_date": "2025-04-23",
  "requirements": "At Jack Henry, we deliver technology solutions that are digitally transforming and empowering community banks and credit unions to provide enhanced and streamlined user experiences to their customers and members. Our best-in-class products are just the start as we lay the groundwork for the future of digital banking and payments. We hope you'll join us. We can't do it without you. The Software Engineer III participates in the technical design and implementation of new products or enhancements to existing applications, based on business requirements. This role participates in all phases of the development cycle: concept, technical design, prototype, code development, testing, release to QA and implementation. This position requires cross functional collaboration. What you’ll be responsible for:   Completes product technical design and prototyping, software development, bug verification and resolution.   Performs system analysis and programming activities which may require research and timely, effective, and quality delivery of software into production.  Provides technical/engineering support for new and existing applications from code delivery until the retirement of the application.  Develops and tests applications based on business requirements and industry best practices.  Uses best practices and standard guidance to create and modify code. Considers how code changes will affect end users and internal teams.  Participates in cross team projects as needed.  Works on critical tasks and deliverables with minimal assistance, and sets and updates expectations on size, scope, and timelines.  May represent team in cross-team meetings and discussions.  Adheres to documented departmental and corporate standards. Participates in the definition and documentation of standards.  Plans unit tests and integration tests to ensure the reliability, security, and performance of developed software.  Debugs and troubleshoots issues as they arise, providing timely resolutions.  Performs other duties as assigned.   What you’ll need to have:   5 years of experience in software development including experience within back-end development using Microservices in .NET, C# or Golang.  Experience with containerization using Kubernetes and CI/CD using GitHub actions.  Must have experience developing cloud hosted applications (e.g., AWS and/or Google Cloud Platform) What would be nice for you to have:   Bachelor’s degree in software development, or a related field, preferred, but not required.  Experience with Agile Development Methodologies.  QA Testing Practices and Postman automation testing.  Experience with Git-based repositories.  Experience with Infrastructure as Code (IaC) using Terraform.  Front-end development using HTML, Lit, and TypeScript.  Key Vaults and Certificate Management experience.  Ability to assess circumstances using sophisticated analytical and problem-solving techniques to identify root cause.   Strong knowledge in the following areas:   Knowledge in software development methodologies   Domain and industry knowledge   Ability to demonstrate strong skills in the following areas:   Software design and implementation   Analysis and design at multiple-project level   Research, analysis and problem resolution   Communication and interpersonal skills   Strong organization and time management skills   Ability to create deliverables for each phase of the development cycle.   If you got this far, we hope you're feeling excited about this opportunity. Even if you don't feel you meet every single requirement on this posting, we still encourage you to apply. We're eager to meet motivated people who align with Jack Henry's mission and can contribute to our company in a variety of ways. Why Jack Henry? At Jack Henry, we pride ourselves through our motto of, \"Do the right thing, do whatever it takes, and have fun.\" We recognize the value of our associates and believe much of our company's strength and success depends on their well-being. We demonstrate our commitment by offering outstanding benefit programs to ensure the physical, mental & financial well-being of our people is always met. Culture of Commitment Ask our associates why they love Jack Henry, and many will tell you it is because our culture is exceptional. We do great things together. Rising to meet challenges and seeking opportunities is part of who we are as an organization. Our culture has helped us stay strong through challenging times and we credit our dedicated associates for our success. Visit our Corporate Responsibility site to learn more about our culture and commitment to our people, customers, community, environment, and shareholders.",
  "salary_annual": null,
  "company_country": "US",
  "company_address": null,
  "classification": "remote_timezone",
  "source_url": "https://www.golangprojects.com/golang-go-job-gpu-Remote-Software-Engineer-III-Jack-Henry-remotework.html",
  "scraped_at": "2025-05-04T12:27:28.930176+00:00"
}