{
  "job_title": "Senior Software Engineer - Kube Team",
  "company": "Cast AI",
  "posted_date": "2025-04-04",
  "requirements": "Core values that hold us all together:\nPRACTICE CUSTOMER OBSESSION. Focus on the customer journey and work backwards. Strive to deliver customer value and continuously solve customer problems. Listen to customer feedback, act, and iterate to improve customer experience.\n\nLEAD. Take ownership and lead through action. Think and act on behalf of the entire company to build long-term value across team boundaries.\n\nDEVELOP AND HIRE THE BEST. Strive to raise the performance bar by continuously investing in yourself, the team and by hiring the best possible candidates for every position. Drive towards personal development and professional growth, and mentor others to raise the collective bar.\n\nEXPECT AND ADVOCATE CHANGE. Strive to innovate and accept the inevitable change that comes with innovation. Constantly welcome new ideas and opinions. Share insights responsibly with unwavering openness, honesty, and respect. Once a path is chosen, be ready to disagree and commit to a direction.\n\nWhat does Kube Team do?\nThe Kube Team serves as the bedrock upon which our cost optimisation product suite rests. Customers initiate their experience with cost optimisation product through the infrastructure and solutions constructed by this team. Additionally, the CAST AI Optimisation Engine leverages these foundational elements to realise significant AAA savings for our clients.\n\nTo give you a glimpse into the complexities we navigate:\n\nWe've successfully engineered ways to integrate independent Kubernetes nodes into existing third-party clusters like EKS, GKE, and AKS. Given the absence of official documentation, this required a good deal of reverse engineering and yielded invaluable insights.\nWe have authored our own Terraform provider.\nWe developed a highly parallelised engine capable of managing and reconciling the diverse clusters of our numerous customers.\nWe've implemented a unified API that abstracts away the differing implementations across various cloud providers\nWe're SME of lower level infrastructure (operating systems, cloud networking, storage and virtualisation) at CAST AI.\nThe above examples merely scratch the surface of what we've achieved. Consider that these efforts are magnified by the range of cloud providers we support - and each one presents its own unique challenges. Each development sprint uncovers new hurdles and learning opportunities. We consider ourselves fortunate to operate in a cutting edge technological landscape.\n\nHere are some of the technologies we use in the stack:\nGoLang is our language.\nKubernetes is our core product.\nAWS, GCP, and Azure are the clouds we operate.\nPostgres and cloud object storage for persistence.\nTerraform for IaC.\nGCP PubSub for messaging.\nGRPC and REST APIs.\nWe use GitLab CI with ArgoCD as our GitOps CD engine.\nPrometheus, Grafana, Loki, and Tempo for observability.\nDeployment charts are written in Helm.\nHaving experience with these tools is not a strict prerequisite for the ideal candidate, but it does offer a competitive edge.\n\nRequirements:\nYou have to be physically in any of the European countries GMT 0 to GMT +3\nStrong software engineering skills\nStrong English skills\nStrong verbal and written communications skills\nAbility to work independently or with a group\nA “yes we can” attitude\n",
  "salary_annual": "78000-108000 EUR",
  "company_country": null,
  "company_address": null,
  "classification": "remote_timezone",
  "source_url": "https://www.golangprojects.com/golang-go-job-gvs-Remote-Europe-Senior-Software-Engineer-Kube-Team-Cast-AI-remotework.html",
  "scraped_at": "2025-05-04T07:51:24.529988+00:00"
}